In [1]:
import pandas as pd

In [2]:
file_path = "/workspaces/tir102/data-pipeline/resource/data_with_nan.csv"

df = pd.read_csv(file_path)

df

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN
4  test5   NaN  bbb
5    NaN   NaN  NaN

In [3]:
df["col3"][0]

nan

In [4]:
type(df["col3"][0])

float

In [5]:
type(None)

NoneType

In [6]:
df["col2"]

0    13.0
1    44.0
2     NaN
3     NaN
4     NaN
5     NaN
Name: col2, dtype: float64

In [7]:
df["col2"].mean()

np.float64(28.5)

In [8]:
import numpy as np

In [9]:
np.nan

nan

In [10]:
df["col1"].isna()

0    False
1    False
2    False
3     True
4    False
5     True
Name: col1, dtype: bool

In [11]:
df[
    df["col1"].isna()
]

  col1  col2 col3
3  NaN   NaN  NaN
5  NaN   NaN  NaN

In [12]:
help(pd.isnull)

Help on function isna in module pandas.core.dtypes.missing:

isna(obj: 'object') -> 'bool | npt.NDArray[np.bool_] | NDFrame'
    Detect missing values for an array-like object.

    This function takes a scalar or array-like object and indicates
    whether values are missing (``NaN`` in numeric arrays, ``None`` or ``NaN``
    in object arrays, ``NaT`` in datetimelike).

    Parameters
    ----------
    obj : scalar or array-like
        Object to check for null or missing values.

    Returns
    -------
    bool or array-like of bool
        For scalar input, returns a scalar boolean.
        For array input, returns an array of boolean indicating whether each
        corresponding element is missing.

    See Also
    --------
    notna : Boolean inverse of pandas.isna.
    Series.isna : Detect missing values in a Series.
    DataFrame.isna : Detect missing values in a DataFrame.
    Index.isna : Detect missing values in an Index.

    Examples
    --------
    Scalar arguments (including strings) result in a scalar boolean.

    >>> pd.isna('dog')
    False

    >>> pd.isna(pd.NA)
    True

    >>> pd.isna(np.nan)
    True

    ndarrays result in an ndarray of booleans.

    >>> array = np.array([[1, np.nan, 3], [4, 5, np.nan]])
    >>> array
    array([[ 1., nan,  3.],
           [ 4.,  5., nan]])
    >>> pd.isna(array)
    array([[False,  True, False],
           [False, False,  True]])

    For indexes, an ndarray of booleans is returned.

    >>> index = pd.DatetimeIndex(["2017-07-05", "2017-07-06", None,
    ...                           "2017-07-08"])
    >>> index
    DatetimeIndex(['2017-07-05', '2017-07-06', 'NaT', '2017-07-08'],
                  dtype='datetime64[ns]', freq=None)
    >>> pd.isna(index)
    array([False, False,  True, False])

    For Series and DataFrame, the same type is returned, containing booleans.

    >>> df = pd.DataFrame([['ant', 'bee', 'cat'], ['dog', None, 'fly']])
    >>> df
         0     1    2
    0  ant   bee  cat
    1  dog  None  fly
    >>> pd.isna(df)
           0      1      2
    0  False  False  False
    1  False   True  False

    >>> pd.isna(df[1])
    0    False
    1     True
    Name: 1, dtype: bool

In [13]:
df[
    df["col1"].notna()
]

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
4  test5   NaN  bbb

In [14]:
df[
    ~(df["col1"].isna())
]

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
4  test5   NaN  bbb

In [15]:
df.dropna()

    col1  col2 col3
1  test2  44.0  aaa

In [16]:
df.dropna(how="all")

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
4  test5   NaN  bbb

In [17]:
df

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN
4  test5   NaN  bbb
5    NaN   NaN  NaN

In [18]:
df.dropna(thresh=2)

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
4  test5   NaN  bbb

In [19]:
df["col2"].fillna(0)

0    13.0
1    44.0
2     0.0
3     0.0
4     0.0
5     0.0
Name: col2, dtype: float64

In [20]:
df["col2_fill_0"] = df["col2"].fillna(0)
df

    col1  col2 col3  col2_fill_0
0  test1  13.0  NaN         13.0
1  test2  44.0  aaa         44.0
2  test3   NaN  NaN          0.0
3    NaN   NaN  NaN          0.0
4  test5   NaN  bbb          0.0
5    NaN   NaN  NaN          0.0

In [21]:
df["col1"].fillna(method="ffill")

/tmp/ipykernel_79661/2941000901.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["col1"].fillna(method="ffill")

0    test1
1    test2
2    test3
3    test3
4    test5
5    test5
Name: col1, dtype: object

In [22]:
df["col1"].ffill()

0    test1
1    test2
2    test3
3    test3
4    test5
5    test5
Name: col1, dtype: object

In [23]:
df["col3"].bfill()

0    aaa
1    aaa
2    bbb
3    bbb
4    bbb
5    NaN
Name: col3, dtype: object

In [25]:
df["col1"].fillna("Unknown")

0      test1
1      test2
2      test3
3    Unknown
4      test5
5    Unknown
Name: col1, dtype: object